src/main/resources/bseXmlRequests/mfOrderEntryLumpsumRequest.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:bses="http://bsestarmf.in/">
   <soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
		<wsa:To>http://bsestarmfdemo.bseindia.com/MFOrderEntry/MFOrder.svc</wsa:To>
		<wsa:Action>http://bsestarmf.in/MFOrderEntry/orderEntryParam</wsa:Action>
	</soap:Header>
   <soap:Body>
      <bses:orderEntryParam>
         <!--Optional:-->
         <bses:TransCode>?</bses:TransCode>
         <!--Optional:-->
         <bses:TransNo>?</bses:TransNo>
         <!--Optional:-->
         <bses:OrderId>?</bses:OrderId>
         <!--Optional:-->
         <bses:UserID>?</bses:UserID>
         <!--Optional:-->
         <bses:MemberId>?</bses:MemberId>
         <!--Optional:-->
         <bses:ClientCode>?</bses:ClientCode>
         <!--Optional:-->
         <bses:SchemeCd>?</bses:SchemeCd>
         <!--Optional:-->
         <bses:BuySell>?</bses:BuySell>
         <!--Optional:-->
         <bses:BuySellType>?</bses:BuySellType>
         <!--Optional:-->
         <bses:DPTxn>?</bses:DPTxn>
         <!--Optional:-->
         <bses:OrderVal>?</bses:OrderVal>
         <!--Optional:-->
         <bses:Qty>?</bses:Qty>
         <!--Optional:-->
         <bses:AllRedeem>?</bses:AllRedeem>
         <!--Optional:-->
         <bses:FolioNo>?</bses:FolioNo>
         <!--Optional:-->
         <bses:Remarks>?</bses:Remarks>
         <!--Optional:-->
         <bses:KYCStatus>?</bses:KYCStatus>
         <!--Optional:-->
         <bses:RefNo>?</bses:RefNo>
         <!--Optional:-->
         <bses:SubBrCode>?</bses:SubBrCode>
         <!--Optional:-->
         <bses:EUIN>?</bses:EUIN>
         <!--Optional:-->
         <bses:EUINVal>?</bses:EUINVal>
         <!--Optional:-->
         <bses:MinRedeem>?</bses:MinRedeem>
         <!--Optional:-->
         <bses:DPC>?</bses:DPC>
         <!--Optional:-->
         <bses:IPAdd>?</bses:IPAdd>
         <!--Optional:-->
         <bses:Password>?</bses:Password>
         <!--Optional:-->
         <bses:PassKey>?</bses:PassKey>
         <!--Optional:-->
         <bses:Parma1>?</bses:Parma1>
         <!--Optional:-->
         <bses:Param2>?</bses:Param2>
         <!--Optional:-->
         <bses:Param3>?</bses:Param3>
      </bses:orderEntryParam>
   </soap:Body>
</soap:Envelope>