src/main/resources/bseXmlRequests/mfOrderEntrySwitchRequest.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:bses="http://bsestarmf.in/">
    <soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
		<wsa:To>http://bsestarmfdemo.bseindia.com/MFOrderEntry/MFOrder.svc</wsa:To>
		<wsa:Action>http://bsestarmf.in/MFOrderEntry/switchOrderEntryParam</wsa:Action>
	</soap:Header>
   <soap:Body>
      <bses:switchOrderEntryParam>
         <!--Optional:-->
         <bses:TransCode>?</bses:TransCode>
         <!--Optional:-->
         <bses:TransNo>?</bses:TransNo>
         <!--Optional:-->
         <bses:OrderId>?</bses:OrderId>
         <!--Optional:-->
         <bses:UserId>?</bses:UserId>
         <!--Optional:-->
         <bses:MemberId>?</bses:MemberId>
         <!--Optional:-->
         <bses:ClientCode>?</bses:ClientCode>
         <!--Optional:-->
         <bses:FromSchemeCd>?</bses:FromSchemeCd>
         <!--Optional:-->
         <bses:ToSchemeCd>?</bses:ToSchemeCd>
         <!--Optional:-->
         <bses:BuySell>?</bses:BuySell>
         <!--Optional:-->
         <bses:BuySellType>?</bses:BuySellType>
         <!--Optional:-->
         <bses:DPTxn>?</bses:DPTxn>
         <!--Optional:-->
         <bses:OrderVal>?</bses:OrderVal>
         <!--Optional:-->
         <bses:SwitchUnits>?</bses:SwitchUnits>
         <!--Optional:-->
         <bses:AllUnitsFlag>?</bses:AllUnitsFlag>
         <!--Optional:-->
         <bses:FolioNo>?</bses:FolioNo>
         <!--Optional:-->
         <bses:Remarks>?</bses:Remarks>
         <!--Optional:-->
         <bses:KYCStatus>?</bses:KYCStatus>
         <!--Optional:-->
         <bses:SubBrCode>?</bses:SubBrCode>
         <!--Optional:-->
         <bses:EUIN>?</bses:EUIN>
         <!--Optional:-->
         <bses:EUINVal>?</bses:EUINVal>
         <!--Optional:-->
         <bses:MinRedeem>?</bses:MinRedeem>
         <!--Optional:-->
         <bses:IPAdd>?</bses:IPAdd>
         <!--Optional:-->
         <bses:Password>?</bses:Password>
         <!--Optional:-->
         <bses:PassKey>?</bses:PassKey>
         <!--Optional:-->
         <bses:Parma1>?</bses:Parma1>
         <!--Optional:-->
         <bses:Param2>?</bses:Param2>
         <!--Optional:-->
         <bses:Param3>?</bses:Param3>
      </bses:switchOrderEntryParam>
   </soap:Body>
</soap:Envelope>