src/main/resources/bseXmlRequests/mfOrderEntrySipRequest.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:bses="http://bsestarmf.in/">
    <soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
		<wsa:To>http://bsestarmfdemo.bseindia.com/MFOrderEntry/MFOrder.svc</wsa:To>
		<wsa:Action>http://bsestarmf.in/MFOrderEntry/xsipOrderEntryParam</wsa:Action>
	</soap:Header>
   <soap:Body>
      <bses:xsipOrderEntryParam>
         <!--Optional:-->
         <bses:TransactionCode>?</bses:TransactionCode>
         <!--Optional:-->
         <bses:UniqueRefNo>?</bses:UniqueRefNo>
         <!--Optional:-->
         <bses:SchemeCode>?</bses:SchemeCode>
         <!--Optional:-->
         <bses:MemberCode>?</bses:MemberCode>
         <!--Optional:-->
         <bses:ClientCode>?</bses:ClientCode>
         <!--Optional:-->
         <bses:UserId>?</bses:UserId>
         <!--Optional:-->
         <bses:InternalRefNo>?</bses:InternalRefNo>
         <!--Optional:-->
         <bses:TransMode>?</bses:TransMode>
         <!--Optional:-->
         <bses:DpTxnMode>?</bses:DpTxnMode>
         <!--Optional:-->
         <bses:StartDate>?</bses:StartDate>
         <!--Optional:-->
         <bses:FrequencyType>?</bses:FrequencyType>
         <!--Optional:-->
         <bses:FrequencyAllowed>?</bses:FrequencyAllowed>
         <!--Optional:-->
         <bses:InstallmentAmount>?</bses:InstallmentAmount>
         <!--Optional:-->
         <bses:NoOfInstallment>?</bses:NoOfInstallment>
         <!--Optional:-->
         <bses:Remarks>?</bses:Remarks>
         <!--Optional:-->
         <bses:FolioNo>?</bses:FolioNo>
         <!--Optional:-->
         <bses:FirstOrderFlag>?</bses:FirstOrderFlag>
         <!--Optional:-->
         <bses:Brokerage>?</bses:Brokerage>
         <!--Optional:-->
         <bses:MandateID>?</bses:MandateID>
         <!--Optional:-->
         <bses:SubberCode>?</bses:SubberCode>
         <!--Optional:-->
         <bses:Euin>?</bses:Euin>
         <!--Optional:-->
         <bses:EuinVal>?</bses:EuinVal>
         <!--Optional:-->
         <bses:DPC>?</bses:DPC>
         <!--Optional:-->
         <bses:XsipRegID>?</bses:XsipRegID>
         <!--Optional:-->
         <bses:IPAdd>?</bses:IPAdd>
         <!--Optional:-->
         <bses:Password>?</bses:Password>
         <!--Optional:-->
         <bses:PassKey>?</bses:PassKey>
         <!--Optional:-->
         <bses:Param1>?</bses:Param1>
         <!--Optional:-->
         <bses:Param2>?</bses:Param2>
         <!--Optional:-->
         <bses:Param3>?</bses:Param3>
      </bses:xsipOrderEntryParam>
   </soap:Body>
</soap:Envelope>