request.xml

<?xml version='1.0' encoding='UTF-8'?><SOAP-ENV:Envelope xmlns:ns0='http://bsestarmf.in/' xmlns:SOAP-ENV='http://www.w3.org/2003/05/soap-envelope' xmlns:wsa='http://www.w3.org/2005/08/addressing' xmlns:ns1='http://www.w3.org/2003/05/soap-envelope' xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'><SOAP-ENV:Header><wsa:To>http://bsestarmfdemo.bseindia.com/MFOrderEntry/MFOrder.svc</wsa:To><wsa:Action>http://bsestarmf.in/MFOrderEntry/getPassword</wsa:Action></SOAP-ENV:Header><ns1:Body><ns0:getPassword><ns0:UserId>1038201</ns0:UserId><ns0:Password>123456#</ns0:Password><ns0:PassKey>cat123</ns0:PassKey></ns0:getPassword></ns1:Body></SOAP-ENV:Envelope>

